---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.CutBackgroundPatternId
source: html/fdd76258-57ff-1e74-8899-ee17bff133f6.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.CutBackgroundPatternId Property

The ElementId of the cut face background fill pattern override.
 A value of InvalidElementId means no override is set.

## Syntax (C#)
```csharp
public ElementId CutBackgroundPatternId { get; }
```